a52dec
abseil-cpp
accountsservice
acl
adobe-source-code-pro-fonts
adwaita-cursors
adwaita-icon-theme
adwaita-icon-theme-legacy
alsa-card-profiles
alsa-firmware
alsa-lib
alsa-plugins
alsa-topology-conf
alsa-ucm-conf
alsa-utils
amd-ucode
aom
appstream
aquamarine
archlinux-keyring
argon2
at-spi2-core
atkmm
attr
audit
autoconf
automake
avahi
b43-fwcutter
base
base-devel
bash
bash-completion
bind
binutils
bison
blueman
bluez
bluez-libs
bluez-utils
brave-bin
brotli
btrfs-progs
bubblewrap
bzip2
ca-certificates
ca-certificates-mozilla
ca-certificates-utils
cairo
cairomm
cairomm-1.16
cantarell-fonts
chromaprint
chromium
cinnamon-desktop
cliphist
composefs
coreutils
cpio
cryptsetup
curl
dav1d
db5.3
dbus
dbus-broker
dbus-broker-units
dbus-units
dconf
debugedit
default-cursors
desktop-file-utils
device-mapper
diffutils
ding-libs
dmidecode
dmraid
dnsmasq
dnssec-anchors
dosfstools
double-conversion
downgrade
dracut
duktape
e2fsprogs
editorconfig-core-c
efibootmgr
efitools
efivar
egl-gbm
egl-wayland
egl-x11
eglexternalplatform
ell
enchant
endeavouros-keyring
endeavouros-mirrorlist
eog
eos-dracut
eos-hooks
ethtool
exempi
exfatprogs
expac
expat
f2fs-tools
faac
faad2
fakeroot
fastfetch
fd
ffmpeg
ffmpegthumbnailer
fftw
file
file-roller
filesystem
findutils
firefox
firewalld
flac
flatpak
flex
fluidsynth
fmt
fontconfig
freetype2
fribidi
fuse-common
fuse2
fuse3
fzf
gawk
gc
gcc
gcc-libs
gcr-4
gdbm
gdk-pixbuf2
gettext
giflib
git
glib-networking
glib2
glibc
glibmm
glibmm-2.68
glslang
gmp
gnome-desktop
gnome-desktop-common
gnome-text-editor
gnupg
gnutls
gobject-introspection
gobject-introspection-runtime
gperftools
gpgme
gpm
granite
graphene
graphite
grep
grim
groff
grub
gsettings-desktop-schemas
gsettings-system-schemas
gsm
gssdp
gssproxy
gst-libav
gst-plugin-pipewire
gst-plugins-bad
gst-plugins-bad-libs
gst-plugins-base-libs
gst-plugins-ugly
gstreamer
gtest
gtk-layer-shell
gtk-update-icon-cache
gtk3
gtk4
gtkmm-4.0
gtkmm3
gtksourceview5
guile
gupnp
gupnp-igd
gvfs
gzip
harfbuzz
haveged
hdparm
hicolor-icon-theme
hidapi
highway
hwdata
hwdetect
hyprcursor
hyprgraphics
hypridle
hyprland
hyprlang
hyprlock
hyprpaper
hyprshot
hyprutils
hyprwayland-scanner
iana-etc
icu
imagemagick
imath
inetutils
intellij-idea-community-edition
iproute2
iptables-nft
iputils
iso-codes
iwd
jansson
java-environment-common
java-runtime-common
jbigkit
jdk21-openjdk
jemalloc
jfsutils
jq
json-c
json-glib
jsoncpp
kbd
keyutils
kitty
kitty-shell-integration
kitty-terminfo
kmod
krb5
l-smash
lame
lcms2
less
libadwaita
libaio
libappindicator-gtk3
libarchive
libass
libassuan
libasyncns
libatasmart
libavc1394
libavtp
libb2
libblockdev
libblockdev-crypto
libblockdev-fs
libblockdev-loop
libblockdev-mdraid
libblockdev-nvme
libblockdev-part
libblockdev-swap
libbluray
libbpf
libbs2b
libbsd
libbytesize
libcanberra
libcap
libcap-ng
libcdio
libcdio-paranoia
libcloudproviders
libcolord
libcups
libdaemon
libdatrie
libdbusmenu-glib
libdbusmenu-gtk3
libdc1394
libdca
libde265
libdecor
libdeflate
libdisplay-info
libdovi
libdrm
libdv
libdvdcss
libdvdnav
libdvdread
libedit
libei
libelf
libepoxy
libevdev
libevent
libexif
libfdk-aac
libffi
libfontenc
libfreeaptx
libgcrypt
libgee
libgirepository
libglvnd
libgme
libgnomekbd
libgpg-error
libgsf
libgudev
libhandy
libice
libidn2
libiec61883
libimobiledevice
libimobiledevice-glue
libinih
libinput
libinstpatch
libisl
libjpeg-turbo
libjxl
libksba
liblc3
libldac
libldap
libliftoff
liblqr
liblrdf
libltc
libluv
libmalcontent
libmaxminddb
libmbim
libmd
libmicrodns
libmm-glib
libmnl
libmodplug
libmpc
libmpcdec
libmpdclient
libmpeg2
libmysofa
libnautilus-extension
libndp
libnet
libnetfilter_conntrack
libnewt
libnfnetlink
libnftnl
libnghttp2
libnghttp3
libnice
libnl
libnm
libnma
libnma-common
libnotify
libnsl
libnvme
libogg
libopenmpt
libopenraw
libp11-kit
libpcap
libpciaccess
libpeas
libpgm
libpipeline
libpipewire
libplacebo
libplist
libpng
libproxy
libpsl
libpulse
libqmi
libqrtr-glib
libraqm
libraw1394
librsvg
librsync
libsamplerate
libsasl
libseccomp
libsecret
libsigc++
libsigc++-3.0
libsm
libsndfile
libsodium
libsoup3
libsoxr
libspelling
libsrtp
libssh
libssh2
libstemmer
libsysprof-capture
libtasn1
libteam
libthai
libtheora
libtiff
libtirpc
libtool
libunibreak
libunistring
libunwind
liburcu
liburing
libusb
libusbmuxd
libutempter
libutf8proc
libuv
libva
libvdpau
libverto
libvorbis
libvpl
libvpx
libvterm
libwacom
libwebp
libwireplumber
libwnck3
libx11
libxau
libxaw
libxcb
libxcomposite
libxcrypt
libxcursor
libxcvt
libxdamage
libxdmcp
libxext
libxfixes
libxfont2
libxft
libxi
libxinerama
libxkbcommon
libxkbcommon-x11
libxkbfile
libxklavier
libxml2
libxmlb
libxmu
libxpm
libxrandr
libxrender
libxres
libxshmfence
libxslt
libxss
libxt
libxtst
libxv
libxxf86vm
libyaml
libzip
licenses
lilv
linux
linux-api-headers
linux-firmware
linux-firmware-whence
linux-headers
llvm-libs
lm_sensors
lmdb
logrotate
lsb-release
lsof
lsscsi
lua
lua51-lpeg
luajit
luit
lv2
lvm2
lz4
lzo
m4
mailcap
make
man-db
man-pages
md4c
mdadm
mesa
mesa-utils
minizip
mjpegtools
mobile-broadband-provider-info
modemmanager
mpdecimal
mpfr
mpg123
msgpack-c
mtdev
mtools
nano
ncurses
nemo
nemo-fileroller
neon
netctl
nettle
network-manager-applet
networkmanager
networkmanager-openconnect
networkmanager-openvpn
nfs-utils
nfsidmap
nftables
nilfs-utils
nm-connection-editor
noto-fonts
noto-fonts-cjk
noto-fonts-emoji
noto-fonts-extra
npth
nspr
nss
nss-mdns
ntfs-3g
ntp
nvidia
nvidia-hook
nvidia-inst
nvidia-utils
nwg-look
oath-toolkit
ocl-icd
oniguruma
openal
openconnect
opencore-amr
openexr
openh264
openjpeg2
openssh
openssl
openvpn
opus
orc
os-prober
ostree
p11-kit
pacman
pacman-contrib
pacman-mirrorlist
pacutils
pahole
pam
pambase
pamixer
pango
pangomm
pangomm-2.48
parallel
parted
patch
pavucontrol
pciutils
pcre
pcre2
pcsclite
perl
perl-error
perl-mailtools
perl-timedate
pinentry
pipewire
pipewire-alsa
pipewire-audio
pipewire-jack
pipewire-pulse
pixman
pkcs11-helper
pkgconf
pkgfile
playerctl
plocate
polkit
polkit-gnome
poppler
poppler-glib
popt
portaudio
postman-bin
power-profiles-daemon
ppp
procps-ng
psmisc
pugixml
python
python-autocommand
python-cairo
python-capng
python-dbus
python-gobject
python-jaraco.collections
python-jaraco.context
python-jaraco.functools
python-jaraco.text
python-mako
python-markdown
python-markupsafe
python-more-itertools
python-packaging
python-platformdirs
python-pyqt5
python-pyqt5-sip
python-setuptools
python-wheel
qrencode
qt5-base
qt5-translations
qt6-base
qt6-declarative
qt6-svg
qt6-translations
qt6-wayland
raptor
rav1e
readline
rebuild-detector
reflector
reiserfsprogs
ripgrep
rpcbind
rtkit
rtmpdump
rubberband
s-nail
sbc
sd
sdbus-cpp
sdl2
seatd
sed
serd
sg3_utils
shaderc
shadow
shared-mime-info
slang
slurp
smartmontools
snappy
sndio
sof-firmware
sord
sound-theme-freedesktop
soundtouch
spandsp
spdlog
speex
speexdsp
spirv-tools
sqlite
sratom
srt
starship
startup-notification
stoken
sudo
svt-av1
svt-hevc
swaync
sysfsutils
systemd
systemd-libs
systemd-resolvconf
systemd-sysvcompat
tar
tcl
tdb
texinfo
thin-provisioning-tools
tinysparql
tomlplusplus
tpm2-tss
tree-sitter
tree-sitter-c
tree-sitter-lua
tree-sitter-markdown
tree-sitter-query
tree-sitter-vim
tree-sitter-vimdoc
tslib
ttf-bitstream-vera
ttf-dejavu
ttf-font-awesome
ttf-liberation
ttf-opensans
tzdata
udisks2
unibilium
unrar
unzip
upower
usb_modeswitch
usbutils
util-linux
util-linux-libs
v4l-utils
vapoursynth
vid.stab
vim-runtime
visual-studio-code-bin
vmaf
volume_key
vpnc
vulkan-headers
vulkan-icd-loader
waybar
wayland
wayland-protocols
webp-pixbuf-loader
webrtc-audio-processing-1
which
wildmidi
wireplumber
wl-clipboard
wlogout
wofi
wpa_supplicant
x264
x265
xapp
xbitmaps
xcb-proto
xcb-util
xcb-util-cursor
xcb-util-errors
xcb-util-image
xcb-util-keysyms
xcb-util-renderutil
xcb-util-wm
xcur2png
xdg-dbus-proxy
xdg-desktop-portal
xdg-desktop-portal-hyprland
xdg-user-dirs
xdg-utils
xf86-input-libinput
xf86-video-amdgpu
xf86-video-ati
xfsprogs
xkeyboard-config
xl2tpd
xmlsec
xorg-fonts-encodings
xorg-server
xorg-server-common
xorg-setxkbmap
xorg-xauth
xorg-xdpyinfo
xorg-xinit
xorg-xinput
xorg-xkbcomp
xorg-xkill
xorg-xmodmap
xorg-xprop
xorg-xrandr
xorg-xrdb
xorg-xset
xorg-xwayland
xorgproto
xterm
xvidcore
xxhash
xz
yay
yyjson
zbar
zeromq
zimg
zix
zlib
zoxide
zstd
zvbi
zxing-cpp
